[
    {
        "url": "https://www.cnbc.com/2024/09/26/swiss-central-bank-cuts-rates-by-a-quarter-point.html",
        "header": "Swiss central bank cuts rates by a quarter point in third trim this year",
        "content": "The Swiss National Bank on Thursday took a third step to loosen monetary policy this year, bringing its key interest rate down by 25 basis points to 1.0%.The trim, which had been anticipated by 30 of 32 analysts surveyed in a Reuters poll, marked the SNB's third interest rate reduction of 2024.It was the first major Western central bank to reduce interest rates back in March.The third trim comes amid similar signals from the European Central Bank and the U.S. Federal Reserve, which took the long-awaited plunge to slim down its interest rates with a 50-basis-point . Domestically, Swiss inflation remains subdued, with the latest headline print pointing to a 1.1% annual increase .Speaking to CNBC's Silvia Amaro on Thursday, SNB Chairman Thomas Jordan, who is leaving the central bank at the end of this month, acknowledged that \"further rate cuts may be necessary in order to stabilize inflation within the range of price stability in the next three months,\" but refused to be drawn on how many such policy easing interventions would be necessary.\"In December, the new inflation forecast will tell us exactly in what direction monetary policy should then be adjusted,\" he noted.The bank took its inflation forecast \"significantly lower\" than its June indications, citing the strength of the local currency, a weaker oil price and electricity price cuts announced for next January.The new outlook puts average annual inflation at 1.2% for 2024, 0.6% for 2025 and 0.7% for 2026, compared with 1.3%, 1.1% and 1.0% sketched out in June for the respective periods.The Swiss franc gained ground against major currencies on the back of the latest interest rate decision. The U.S. dollar and euro were down nearly 0.14% and 0.16% against the Swiss coin, respectively — meeting ING analysts'  that the cut would lead to \"outperformance\" of the Swiss currency.The strengthening of the Swiss currency in August prompted one of the country's largest associations, the technology manufacturers' group Swissmem to entreat the SNB to \"act soon, in line with its mandate\" and ease pressures constraining local businesses.\"This renewed exacerbation has come at a sensitive time for one of the key export industries: following a tough period of over a year, a slow recovery was in sight. If the upside pressure cannot be contained, these hopes will dissipate,\"  at the time.The SNB acknowledged the broader trend of its currency rally as a key contributor to the Thursday reduction.\"Inflationary pressure in Switzerland has again decreased significantly compared to the previous quarter. Among other things, this decrease reflects the appreciation of the Swiss franc over the last three months,\" it said in a statement.\"The SNB's easing of monetary policy today takes the reduction in inflationary pressure into account. Further cuts in the SNB policy rate may become necessary in the coming quarters to ensure price stability over the medium term,\" it added.Some analysts have now raised questions whether Switzerland finds itself on the path of combating deflation — a rare sickness among major Western economies that have largely been afflicted with meteoric price rises since the Covid-19 pandemic.\"The SNB has consistently been behind the curve on its inflation forecasts this year, even as it has conditioned them on lower rates each time. The 0.6% forecast for 2025 is likely a bit too close for comfort for a central bank keen to return to deflation,\" said Kyle Chapman, FX markets analyst at Ballinger Group.\"I expect another two 25bp moves in December and March at the very least, primarily because I don't see any near-term sources of depreciation for the franc without a stronger stance on intervention from the SNB. We are heading back towards zero relatively quickly,\" Chapman added. Jordan talked down this risk on Thursday.\"If you look at our inflation forecast, this is still within the range of price stability, so I cannot see any risk of deflation soon,\" Jordan told reporters, according to Reuters. He added that the central bank may nevertheless have to reduce rates again to retain inflation in the 0-2% target range.Adrian Prettejohn, Europe economist at Capital Economics, said that the SNB communique suggested that the central bank's policymakers have likely not used forex interventions \"to a significant extent\" — but may soon resort to such measures.\"We think the SNB will start to consider using FX interventions significantly once the policy rate falls to around 0.5%. At that point it will be a more finely balanced decision as to how much to rely on currency intervention rather than further rate cuts to provide further monetary policy support,\" Prettejohn said in a note.\"We are also very clear that we can use the foreign exchange intervention tool if necessary, and we will do that when we believe it's helpful for having an impact on monetary conditions,\" Jordan told CNBC's Amaro."
    }
]